<?php
/**
 *   Template name: 購物須知
 */

get_header(); ?>


		<main id="main" class="site-main  col-sm-10">

			<article id="post-<?php the_ID(); ?>" <?php post_class(); ?>>
				<header class="entry-header">
					<h1>購物須知</h1>
					<div class="sep">
						<a href="<?php echo site_url(); ?>">首頁</a>  &gt;  <?php  the_title(); ?>
					</div>
				</header><!-- .entry-header -->

				<style media="screen">
					.buy_menu{
						max-width: 900px;
						margin: 100px auto;
					}
					.buy_menu ul{
						text-align: left;
					}
					@media only screen and (max-width: 768px){
						.buynote_slk{display: block;;padding-top:40px ! important;;}
						.buy_menu{display: none;}					 	
					}
				</style>

				<div class="buy_menu">
					<ul>
						<li>
							<a href="#nt1">
							<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30"><path fill="#6E4A39" fill-rule="evenodd" d="M17.383 13.655c-.398-.706 5.74-7.726 7.66-4.328 1.92 3.4-7.262 5.033-7.66 4.328m7.496 7.3c-2.015 3.344-7.953-3.848-7.536-4.541.419-.694 9.55 1.199 7.536 4.542M15 12.264c-.809 0-3.902-8.798 0-8.798 3.904 0 .811 8.798 0 8.798m-.326 14.267c-3.901-.11-.56-8.818.25-8.795.809.023 3.652 8.906-.25 8.795m-1.975-13.01c-.438.683-9.514-1.469-7.404-4.754 2.109-3.283 7.841 4.073 7.404 4.755m-7.899 6.865c-1.822-3.453 7.402-4.825 7.781-4.109.378.717-5.958 7.56-7.78 4.11M15 0C6.716 0 0 6.716 0 15c0 8.285 6.716 15 15 15 8.284 0 15-6.715 15-15 0-8.284-6.716-15-15-15"></path></svg>
							會員常見問題
							</a>
						</li>
						<li>
							<a href="#nt2">
							<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30"><path fill="#6E4A39" fill-rule="evenodd" d="M17.383 13.655c-.398-.706 5.74-7.726 7.66-4.328 1.92 3.4-7.262 5.033-7.66 4.328m7.496 7.3c-2.015 3.344-7.953-3.848-7.536-4.541.419-.694 9.55 1.199 7.536 4.542M15 12.264c-.809 0-3.902-8.798 0-8.798 3.904 0 .811 8.798 0 8.798m-.326 14.267c-3.901-.11-.56-8.818.25-8.795.809.023 3.652 8.906-.25 8.795m-1.975-13.01c-.438.683-9.514-1.469-7.404-4.754 2.109-3.283 7.841 4.073 7.404 4.755m-7.899 6.865c-1.822-3.453 7.402-4.825 7.781-4.109.378.717-5.958 7.56-7.78 4.11M15 0C6.716 0 0 6.716 0 15c0 8.285 6.716 15 15 15 8.284 0 15-6.715 15-15 0-8.284-6.716-15-15-15"></path></svg>
							購物常見問題
							</a>
						</li>
						<li>
							<a href="#nt3">
							<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30"><path fill="#6E4A39" fill-rule="evenodd" d="M17.383 13.655c-.398-.706 5.74-7.726 7.66-4.328 1.92 3.4-7.262 5.033-7.66 4.328m7.496 7.3c-2.015 3.344-7.953-3.848-7.536-4.541.419-.694 9.55 1.199 7.536 4.542M15 12.264c-.809 0-3.902-8.798 0-8.798 3.904 0 .811 8.798 0 8.798m-.326 14.267c-3.901-.11-.56-8.818.25-8.795.809.023 3.652 8.906-.25 8.795m-1.975-13.01c-.438.683-9.514-1.469-7.404-4.754 2.109-3.283 7.841 4.073 7.404 4.755m-7.899 6.865c-1.822-3.453 7.402-4.825 7.781-4.109.378.717-5.958 7.56-7.78 4.11M15 0C6.716 0 0 6.716 0 15c0 8.285 6.716 15 15 15 8.284 0 15-6.715 15-15 0-8.284-6.716-15-15-15"></path></svg>
							配送貨須知
							</a>
						</li>
						<li>
							<a href="#nt4">
							<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30"><path fill="#6E4A39" fill-rule="evenodd" d="M17.383 13.655c-.398-.706 5.74-7.726 7.66-4.328 1.92 3.4-7.262 5.033-7.66 4.328m7.496 7.3c-2.015 3.344-7.953-3.848-7.536-4.541.419-.694 9.55 1.199 7.536 4.542M15 12.264c-.809 0-3.902-8.798 0-8.798 3.904 0 .811 8.798 0 8.798m-.326 14.267c-3.901-.11-.56-8.818.25-8.795.809.023 3.652 8.906-.25 8.795m-1.975-13.01c-.438.683-9.514-1.469-7.404-4.754 2.109-3.283 7.841 4.073 7.404 4.755m-7.899 6.865c-1.822-3.453 7.402-4.825 7.781-4.109.378.717-5.958 7.56-7.78 4.11M15 0C6.716 0 0 6.716 0 15c0 8.285 6.716 15 15 15 8.284 0 15-6.715 15-15 0-8.284-6.716-15-15-15"></path></svg>
							何謂瑕疵品
							</a>
						</li>
						<li>
							<a href="#nt5">
							<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30"><path fill="#6E4A39" fill-rule="evenodd" d="M17.383 13.655c-.398-.706 5.74-7.726 7.66-4.328 1.92 3.4-7.262 5.033-7.66 4.328m7.496 7.3c-2.015 3.344-7.953-3.848-7.536-4.541.419-.694 9.55 1.199 7.536 4.542M15 12.264c-.809 0-3.902-8.798 0-8.798 3.904 0 .811 8.798 0 8.798m-.326 14.267c-3.901-.11-.56-8.818.25-8.795.809.023 3.652 8.906-.25 8.795m-1.975-13.01c-.438.683-9.514-1.469-7.404-4.754 2.109-3.283 7.841 4.073 7.404 4.755m-7.899 6.865c-1.822-3.453 7.402-4.825 7.781-4.109.378.717-5.958 7.56-7.78 4.11M15 0C6.716 0 0 6.716 0 15c0 8.285 6.716 15 15 15 8.284 0 15-6.715 15-15 0-8.284-6.716-15-15-15"></path></svg>
							退換貨及退款
							</a>
						</li>
					</ul>
				</div>


				<div class="selectpicker  buynote_slk" >
					<select class="select  ">
						<option  value="nt1">會員常見問題</option>
						<option  value="nt2">購物常見問題</option>
						<option  value="nt3">配送貨須知</option>
						<option  value="nt4">何謂瑕疵品</option>
						<option  value="nt5">退換貨及退款</option>
					</select>
				</div>



				<div id="buy_note" >

					<div class="note"  id="nt1">
						<h3 >會員常見問題</h3>
						<div class="ask">
							<h4>該如何加入春一枝會員呢？</h4>
							<p>使用臉書快速註冊，或是註冊新帳號，皆可加入春一枝會員，享受更多好康。</p>
						</div>
						<div class="ask">
							<h4>加入會員有什麼好處？</h4>
							<p>無論有無加入會員皆可訂購春一枝商品。加入春一枝會員好處多多，除省去每次皆要輸入訂購基本資料的時間，春一枝更會不定期寄送優惠訊息，會員使用優惠序號獲得折扣，讓您不錯過任何好康！</p>
						</div>
						<div class="ask">
							<h4>忘記密碼怎麼辦？</h4>
							<p>若您忘記密碼，請點選「會員登入」後，請您先點選「忘記密碼」再輸入註冊的電子郵件，系統即會自動將密碼重設通知寄至您預設的E-mail信箱中。請您收取郵件並點擊內文中的連結進行密碼重設即可。</p>
						</div>
						<div class="ask">
							<h4>該如何修改個人資料及密碼？</h4>
							<p>請點選「會員登入」，登入會員帳戶，點選「個人資料及密碼修改」即可。您可由此變更您登入的E-mail帳號、密碼、聯絡電話、寄送地址等個人資料。</p>
						</div>
					</div>
					<hr>

					<div class="note" id="nt2">
						<h3>購物常見問題</h3>
						<div class="ask">
							<h4>請問購物滿多少免運費呢？</h4>
							<p>購物滿2000元免運費。</p>
						</div>
						<div class="ask">
							<h4>想吃的冰棒口味缺貨的原因？</h4>
							<p>春一枝堅持使用「新鮮水果」、「水」、「砂糖」三種原料製成冰棒，無化學食品添加物，每支都以新鮮水果手作製成。因季節氣候影響，春一枝會依照水果的季節性調整冰棒口味。</p>
						</div>
						<div class="ask">
							<h4>缺貨的口味什麼時候會再上架呢？</h4>
							<p>可點選「聯絡我們」留言（也可加入春一枝的LINE：springselection），我們會儘速請專人回覆您。</p>
						</div>
						<div class="ask">
							<h4>綜合盒裝冰品內的口味可以自行挑選嗎？</h4>
							<p>由於水果季節性的因素，綜合冰品目前沒有提供自行選擇口味的服務。綜合冰品口味內容請參考「綜合冰品」商品說明。</p>
						</div>
						<div class="ask">
							<h4>我收到宅配的冰棒，為什麼感覺結凍的狀況不夠好？</h4>
							<p>當您收到冰棒時，冰棒的軟化是因為暫時失溫所造成，並無影響風味本身。因此您可在收到冰棒時，先將冰棒放置冷凍庫，兩小時後即可享用。若是使用保麗龍盒的消費者，冰凍時，須將保麗龍的盒蓋掀開再放置冷凍庫，以避免低溫無法進入盒內。</p>
							<p>由於春一枝冰棒堅持只採用水、砂糖和新鮮水果三種原料，因此結凍效果無法達到像添加化學添加物冰棒的結凍程度。（含其他化學添加物的冰品能增加結凍效果；春一枝無任何化學添加物，因此結凍效果需要較長時間）。</p>
							<p>另外宅配運送過程中，冷凍車之溫度會因冷凍車門開關次數而降溫，影響冰品結凍。若宅配運輸時間拉長，亦可能導致失溫。所以建議消費者收到冰品後，將保麗龍盒蓋打開，放置冷凍庫兩小時後再食用，讓冰品變硬以體會冰棒正港的滋味！</p>
						</div>
					</div>
					<hr/>

					<div class="note"  id="nt3">
						<h3  >配送取貨須知</h3>
						<div class="ask">
							<p>每週可到貨日：周一至周六。</p>
						</div>
						<div class="ask">
							<p>可到貨時段：13：00前、14：00－18：00。</p>
						</div>
						<div class="ask">
							<p>因為冷凍配送的關係，冰品到貨時請務必有人可收貨，並於收到貨後立即將貨品放入冷凍庫（建議將保麗龍盒上蓋打開後再放入冷凍庫，結凍效果更佳)</p>
						</div>
						<div class="ask">
							<p>春一枝會按客人指定時間提前出貨，但宅配人員會自行安排當日路線，若客戶當時不在，則會轉至其他地區先進行配送，因此有可能造成延誤。當宅配貨運量較大時，如年節、端午節、中秋節、聖誕節等節慶，可能會無法在指定時段內配達，也有可能造成延誤。在此請消費者多多包涵宅配人員的辛苦。春一枝感謝您！</p>
						</div>
					</div>
					<hr/>

					<div class="note"  id="nt4">
						<h3 >何謂瑕疵品？</h3>
						<div class="ask">
							<p>拆封前，包裝袋已有破損或封口未完全之狀況。（每枝冰棒皆有獨立包裝）</p>
						</div>
						<div class="ask">
							<p>冰品融化變形。</p>
						</div>
						<div class="ask">
							<p>冰棒成份為新鮮水果，採手工製作，若有異物請勿食用並告知，以便退換。</p>
						</div>
					</div>
					<hr/>

					<div class="note"  id="nt5">
						<h3 >退換貨及退款</h3>
						<div class="ask">
							<p>如收到瑕疵品，請儘速與我們聯繫（0978-178-553），將有專人為您提供退換貨或退款之處理。</p>
						</div>
					</div>

				</div> <!-- #buy_note -->



				<div class="entry-content">
					<?php
						the_content();
					?>
				</div><!-- .entry-content -->
			</article><!-- #post-<?php the_ID(); ?> -->



			<?php
			while ( have_posts() ) : the_post();

				// get_template_part( 'template-parts/content', 'page' );


			endwhile; // End of the loop.
			?>

		</main><!-- #main -->

<?php
// get_sidebar();
get_footer();
